In [2]:
import pandas as pd
import numpy as np
from sklearn.neighbors import NearestNeighbors

In [3]:
def find_nearest(group, match, groupname):
    match = match[match[groupname] == group.name]
    nbrs = NearestNeighbors(1).fit(match['Date'].values[:, None])
    dist, ind = nbrs.kneighbors(group['Date'].values[:, None])

    group['Date1'] = group['Date']
    group['Date'] = match['Date'].values[ind.ravel()]
    return group

In [4]:
df1 = pd.read_csv("allAvg.csv")
df2 = pd.read_csv("sickomode.csv")

In [7]:
df1.head()

,Date,Brand,AvgPrice,UnitSold,DrakeT,KanyeT,YeezyT,OffWhiteT
0,1/1/2018,Yeezy,408.834646,127,11,6,8,3
1,1/2/2018,Off-White,652.250000,16,11,6,8,3
2,1/2/2018,Yeezy,408.099379,161,11,6,8,3
3,1/3/2018,Off-White,842.090909,22,11,6,8,3
4,1/3/2018,Yeezy,394.303798,158,11,6,8,3

In [8]:
df2.head()

,Week,checks over stripes: (United States),SICKO MODE: (United States),sum
0,2/25/2018,0,0,0
1,3/4/2018,0,0,0
2,3/11/2018,0,0,0
3,3/18/2018,0,0,0
4,3/25/2018,0,0,0

In [10]:
df1['Date'] = pd.to_datetime(df1['Date'])

In [11]:
df1.dtypes

Date         datetime64[ns]
Brand                object
AvgPrice            float64
UnitSold              int64
DrakeT                int64
KanyeT                int64
YeezyT                int64
OffWhiteT             int64
dtype: object

In [12]:
df2['Week'] = pd.to_datetime(df2['Week'])

In [13]:
df2.dtypes

Week                                    datetime64[ns]
checks over stripes: (United States)             int64
SICKO MODE: (United States)                      int64
sum                                              int64
dtype: object

In [14]:
df1 = df1.set_index("Date")

In [15]:
df2 = df2.set_index("Week")

In [16]:
df3 = df2.reindex(df1.index, method='nearest')

In [17]:
df3.head()

,checks over stripes: (United States),SICKO MODE: (United States),sum
Date,,,
2018-01-01,0,0,0
2018-01-02,0,0,0
2018-01-02,0,0,0
2018-01-03,0,0,0
2018-01-03,0,0,0

In [19]:
df4 = pd.concat([df1, df3], axis=1)

In [20]:
df4.head()

,Brand,AvgPrice,UnitSold,DrakeT,KanyeT,YeezyT,OffWhiteT,checks over stripes: (United States),SICKO MODE: (United States),sum
Date,,,,,,,,,,
2018-01-01,Yeezy,408.834646,127,11,6,8,3,0,0,0
2018-01-02,Off-White,652.250000,16,11,6,8,3,0,0,0
2018-01-02,Yeezy,408.099379,161,11,6,8,3,0,0,0
2018-01-03,Off-White,842.090909,22,11,6,8,3,0,0,0
2018-01-03,Yeezy,394.303798,158,11,6,8,3,0,0,0

In [25]:
df4.to_csv("avgSicko.csv")